# IMPORTACIONES

In [1]:
import pandas as pd
import sqlalchemy as alch
from getpass import getpass

# CONEXIONES

In [2]:
password = getpass("Introduce tu contraseña del server mysql")

Introduce tu contraseña del server mysql········

In [3]:
db_name = "publications"
conec = f"mysql+pymysql://root:{password}@localhost/{db_name}"

In [4]:
engine = alch.create_engine(conec)
print("me conecté")

me conecté

# TABLAS

In [5]:
engine.execute("""
DROP DATABASE if exists publications ;
""")

In [6]:
engine.execute("""
CREATE DATABASE publications; 
""")

In [7]:
engine.execute("""
USE publications ; 
""")

In [8]:
engine.execute(
"""
DROP TABLE if exists usuarios;
"""

)

In [9]:
engine.execute("""
CREATE TABLE usuarios(

usu_id INT PRIMARY KEY AUTO_INCREMENT,
usu_name  VARCHAR (40) NOT NULL
);
"""
)

In [10]:
engine.execute("""
CREATE TABLE grupos(

gr_id INT PRIMARY KEY AUTO_INCREMENT,
gr_name VARCHAR (40) NOT NULL
);
"""
)

In [11]:
engine.execute("""
CREATE TABLE mensajes(

men_id INT PRIMARY KEY AUTO_INCREMENT,
date DATE, 
texto VARCHAR (40) NOT NULL,
gr_id INT,
usu_id INT,
FOREIGN KEY(usu_id) REFERENCES usuarios(usu_id) ON DELETE CASCADE,
FOREIGN KEY(gr_id) REFERENCES grupos(gr_id) ON DELETE CASCADE

);
"""
)

In [12]:
engine.execute("""
CREATE TABLE conexion(

con_id INT PRIMARY KEY AUTO_INCREMENT,
gr_id INT,
usu_id INT,
FOREIGN KEY(usu_id) REFERENCES usuarios(usu_id) ON DELETE CASCADE,
FOREIGN KEY(gr_id) REFERENCES grupos(gr_id) ON DELETE CASCADE
);
"""
)

# metems  info a mano

In [13]:
engine.execute("""

INSERT INTO usuarios VALUES
(1, 'James'), 
(2, "Breska"), 
(3, "Anitu");

"""
)

In [14]:
engine.execute("""

INSERT INTO grupos (gr_name) VALUES
("Familia"), 
("Trabajo"), 
("Veraneo que te veo");

"""
)

In [15]:
engine.execute("""

INSERT INTO conexion VALUES
(1, 1, 1), 
(2, 1, 2), 
(4, 2, 1),
(5, 2, 3);

"""
)

# Harry_Potter in sql

A continuación meteremos los datos limpiados de la pelicula de harry potter en nuestro sql, lo cual nos servirá a la hora de hacer las llamadas.

In [16]:
 data = pd.read_csv('./data/harry_potter')

In [17]:
data.drop("Unnamed: 0", axis=1, inplace=True)

In [18]:
data.head()

   scene    character_name                                           dialogue
0     29      Harry Potter                                     Wait a minute.
1     29       Ron Weasley  You understand right, Harry. Once I make my mo...
2     29      Harry Potter                                       No, Ron, no!
3     29  Hermione Granger                                        What is it?
4     29      Harry Potter                   He's going to sacrifice himself.

# Alimentamos los usuarios

In [19]:
usu =  pd.DataFrame(data.character_name.unique())

In [36]:
usu.columns = ["usu_name"]

In [21]:
for i, fila in usu.iterrows():
    engine.execute(
        f"""
        INSERT INTO usuarios (usu_name) VALUES
        ("{fila['usu_name']}");
       """
    )

In [22]:
query = f""" SELECT usu_id, usu_name
FROM usuarios

"""
usus = pd.read_sql_query(query,engine)

In [23]:
usus

   usu_id           usu_name
0       1              James
1       2             Breska
2       3              Anitu
3       4       Harry Potter
4       5        Ron Weasley
5       6   Hermione Granger
6       7  Quirinus Quirrell
7       8          Voldemort
8       9   Albus Dumbledore
9      10      Rubeus Hagrid

# Alimentamos los grupos

In [29]:
gr =  pd.DataFrame(data.scene.unique())

In [30]:
gr

    0
0  29
1  30
2  31
3  32
4  33
5  34

In [33]:
gr.columns = ["gr_name"]

In [39]:
for i, fila in gr.iterrows():
    engine.execute(
        f"""
        INSERT INTO grupos(gr_name) VALUES
        ("{fila['gr_name']}");
       """
    )

In [41]:
query = f""" SELECT gr_id, gr_name
FROM grupos

"""
grupos = pd.read_sql_query(query,engine)

In [45]:
grupos.head()

   gr_id             gr_name
0      1             Familia
1      2             Trabajo
2      3  Veraneo que te veo
3      4                  29
4      5                  30

# Pendiente generar conexiones y meter mensajes